## Merging and Joining Data

In [28]:
import pandas as pd

employees = pd.DataFrame({
    "EmpID": [1,2,3],
    "Name": ['Alice', 'Bob', 'Charlie'],
    "DeptID": [10,20,30]
})

departments = pd.DataFrame({
    "DeptID": [10,20,40],
    "DeptName": ['HR', 'Engineering', 'Marketing']
})

In [16]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [17]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

### pd.merge()   --> Inner Join  (default)

In [23]:
pd.merge(employees, departments, on="DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [34]:
pd.merge(employees, departments, on="DeptID", how="left")    # Left Join (Left all Rows) --> employees rows

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [35]:
pd.merge(employees, departments, on="DeptID", how="right")   # Right Join (Right all Rows) --> departments rows

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [36]:
pd.merge(employees, departments, on="DeptID", how="outer")   # Outer join (All Rows)

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

## Concatinating DataFrames

In [37]:
df1 = pd.DataFrame({"Name": ["Alice","Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie","David"]})

In [38]:
df1

    Name
0  Alice
1    Bob

In [39]:
df2

      Name
0  Charlie
1    David

In [42]:
pd.concat([df1,df2])   # verticaly

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [43]:
pd.concat([df1,df2], axis=1)  # Horizontaly

    Name     Name
0  Alice  Charlie
1    Bob    David